---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalLoadClassification.ActualElectricalLoadLabel
source: html/3fe33973-722e-d21f-b55c-7a997040ee74.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalLoadClassification.ActualElectricalLoadLabel Property

The name template for the actual load parameter on the load classification.

## Syntax (C#)
```csharp
public string ActualElectricalLoadLabel { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: actualElectricalLoadLabel is not a valid globalization format string.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null